Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: Authors: Lucas Nussbaum
pt_pt: Autores(as): Lucas Nussbaum

source: Maintainer: Lucas Nussbaum
pt_pt: Mantenedor(a): Lucas Nussbaum

source: Availability: Debian package packaging-tutorial
pt_pt: Disponibilidade: Pacote Debian packaging-tutorial

source: The latest LaTeX source is available through the Git repository.
pt_pt: O LaTeX fonte mais recente está disponível através do repositório Git.

source: · Web interface: https://salsa.debian.org/debian/packaging-tutorial
pt_pt: · Interface web: https://salsa.debian.org/debian/packaging-tutorial

source: · VCS interface: git clone https://salsa.debian.org/debian/packaging-tutorial.git
pt_pt: · Interface VCS: git clone https://salsa.debian.org/debian/packaging-tutorial.git

source: Debian Menu System
pt_pt: Sistema de menus do Debian

source: This manual describes the Debian Menu System and the menu package.
pt_pt: Este manual descreve o sistema de menus do Debian e o pacote menu.

source: The menu package was inspired by the install-fvwm2-menu program from the old fvwm2 package.
pt_pt: O pacote menu foi inspirado no programa install-fvwm2-menu do antigo pacote fvwm2.

source: However, menu tries to provide a more general interface for menu building.
pt_pt: No entanto, o pacote menu tenta fornecer uma interface mais geral para construção de menus.

source: With the update-menus command from this package, no package needs to be modified for every X window manager again, and it provides a unified interface for both text- and X-oriented programs.
pt_pt: Com o comando update-menus deste pacote, nenhum pacote precisa ser modificado novamente para cada gerenciador de janelas X, e fornece uma interface unificada para programas orientados a texto e X.

source: Authors: Joost Witteveen, Joey Hess, Christian Schwarz
pt_pt: Autores(as): Joost Witteveen, Joey Hess, Christian Schwarz

source: Maintainer: Joost Witteveen
pt_pt: Mantenedor(a): Joost Witteveen

source: Availability: Debian package menu HTML online
pt_pt: Disponibilidade: Pacote Debian menu HTML on-line

source: Debian Installer internals
pt_pt: Mecanismos do instalador Debian

source: This document is intended to make Debian Installer more accessible to new developers and as a central location to document technical information.
pt_pt: Este documento tem como objetivo tornar o instalador Debian mais acessível a novos(as) desenvolvedores(as) e como local central para documentar informações técnicas.

source: Authors: Frans Pop
pt_pt: Autores(as): Frans Pop

source: Availability: HTML online
pt_pt: Disponibilidade: HTML on-line

source: DocBook XML source online
pt_pt: Fonte XML do DocBook online

source: dbconfig-common documentation
pt_pt: Documentação dbconfig-common

source: This document is intended for package maintainers who maintain packages that require a working database.
pt_pt: Este documento é destinado a mantenedores(as) de pacotes que mantêm pacotes que requerem um banco de dados funcional.

source: Instead of implementing the required logic themselves they can rely on dbconfig-common to ask the right questions during install, upgrade, reconfigure and deinstall for them and create and fill the database.
pt_pt: Em vez de implementar a lógica necessária eles mesmos, eles podem confiar no dbconfig-common para fazer as perguntas certas ao instalar, atualizar, reconfigurar e desinstalar, e criar e preencher os banco de dados.

source: Authors: Sean Finney and Paul Gevers
pt_pt: Autores(as): Sean Finney and Paul Gevers

source: Maintainer: Paul Gevers
pt_pt: Mantenedor(a): Paul Gevers

source: Availability: Debian package dbconfig-common
pt_pt: Disponibilidade: Pacote Debian dbconfig-common

source: · Web interface: https://salsa.debian.org/debian/dbconfig-common
pt_pt: · Interface web: https://salsa.debian.org/debian/dbconfig-common

source: · VCS interface: git clone https://salsa.debian.org/debian/dbconfig-common.git
pt_pt: · Interface VCS: git clone https://salsa.debian.org/debian/dbconfig-common.git

source: Additional also the design document is available.
pt_pt: Adicionalmente, o documento de design está disponível.

source: A proposed policy for packages that depend on a working database.
pt_pt: Uma proposta de política para pacotes que dependem de um banco de dados funcional.

source: Authors: Sean Finney
pt_pt: Autores(as): Sean Finney

source: Status: draft
pt_pt: Estado: esboço

source: dansk Deutsch español français Indonesia Italiano 한국어 (Korean) Nederlands 日本語 (Nihongo) polski Português Русский (Russkij) suomi svenska 中文(简) 中文(HK) 中文(繁)
pt_pt: dansk Deutsch English español français Indonesia Italiano 한국어 (Korean) Nederlands 日本語 (Nihongo) polski Русский (Russkij) suomi svenska 中文(简) 中文(HK) 中文(繁)

source: Last Modified: Mon, Mar 21 02:30:16 UTC 2022 Last Built: Tue, Aug 6 19:44:16 UTC 2024
pt_pt: Última Modificação: Sex, 25 de Mar de 2022, 22:41:28 UTC Última compilação: Ter, 6 de Ago de 2024, 22:06:35 UTC

source: Debian Releases / Debian “lenny” Release Information / Debian GNU/Linux 5.0 -- Errata
pt_pt: Versões/Lançamentos Debian / Informações de lançamento do Debian ”lenny&rdquo / Debian GNU/Linux 5.0 -- Errata

source: · Known problems
pt_pt: · Problemas conhecidos

source: · Security issues
pt_pt: · Problemas de segurança

source: · Point releases
pt_pt: · Lançamentos pontuais

source: · Installation system
pt_pt: · Sistema de instalação

source: Known problems
pt_pt: Problemas conhecidos

source: Warning about key 4D270D06F42584E6 when upgrading
pt_pt: Aviso sobre a chave 4D270D06F42584E6 ao atualizar

source: After adding Lenny to your sources.list for upgrading, you will most likely see a warning about missing key 4D270D06F42584E6.
pt_pt: Depois de adicionar o lenny ao seu sources.list para atualização, você provavelmente verá um aviso sobre a falta da chave 4D270D06F42584E6.

source: This is because the Release file for Lenny is signed with two keys, one that is available in Etch, and another one that wasn't initially shipped with it.
pt_pt: Isso ocorre porque o arquivo Release para o lenny é assinado com duas chaves, uma que está disponível no etch e outra que não foi enviada inicialmente com ele.

source: The warning is harmless, because having one key to verify the Release file is enough, but just updating your Etch system once more before upgrading to Lenny should make the warning go away (version 2009.01.31 of the debian-archive-keyring package should get installed).
pt_pt: O aviso é inofensivo porque ter uma chave para verificar o arquivo Release é suficiente, mas apenas atualizar seu sistema etch mais uma vez antes de atualizar para o lenny deve fazer com que o aviso desapareça (versão 2009.01.31 do pacote debian-archive-keyring deve ser instalado).

source: Security issues
pt_pt: Problemas de segurança

source: Debian security team issues updates to packages in the stable release in which they've identified problems related to security.
pt_pt: A equipe de segurança Debian emite atualizações para pacotes na versão estável (stable), nos quais eles(as) identificaram problemas relacionados à segurança.

source: Please consult the security pages for information about any security issues identified in lenny.
pt_pt: Por favor consulte as páginas de segurança para obter informações sobre quaisquer problemas de segurança identificados no lenny.

source: If you use APT, add the following line to /etc/apt/sources.list to be able to access the latest security updates:
pt_pt: Se você usa o APT, adicione a seguinte linha ao /etc/apt/sources.list para poder acessar as atualizações de segurança mais recentes:

source: After that, run apt-get update followed by apt-get upgrade.
pt_pt: Depois disso, execute apt-get update seguido por apt-get upgrade.

source: Point releases
pt_pt: Lançamentos pontuais

source: Sometimes, in the case of several critical problems or security updates, the released distribution is updated.
pt_pt: Às vezes, no caso de vários problemas críticos ou atualizações de segurança, a versão já lançada é atualizada.

source: Generally, these are indicated as point releases.
pt_pt: Geralmente, as atualizações são indicadas como lançamentos pontuais.

source: · The first point release, 5.0.1, was released on April 11, 2009.
pt_pt: · A primeira versão pontual, 5.0.1, foi lançada em 11 de abril de 2009.

source: · The second point release, 5.0.2, was released on June 27, 2009.
pt_pt: · A segunda versão pontual, 5.0.2, foi lançada em 27 de junho de 2009.

source: · The third point release, 5.0.3, was released on September 5, 2009.
pt_pt: · A terceira versão pontual, 5.0.3, foi lançada em 5 de setembro de 2009.

source: · The fourth point release, 5.0.4, was released on January 30, 2010.
pt_pt: · A quarta versão pontual, 5.0.4, foi lançada em 30 de janeiro de 2010.

source: · The fifth point release, 5.0.5, was released on June 26, 2010.
pt_pt: · A quinta versão pontual, 5.0.5, foi lançada em 26 de junho de 2010.

source: · The sixth point release, 5.0.6, was released on September 4, 2010.
pt_pt: · A sexta versão pontual, 5.0.6, foi lançada em 4 de setembro de 2010.

source: · The seventh point release, 5.0.7, was released on November 27, 2010.
pt_pt: · A sétima versão pontual, 5.0.7, foi lançada em 27 de novembro de 2010.

source: · The eighth point release, 5.0.8, was released on January 22, 2011.
pt_pt: · A oitava versão pontual, 5.0.8, foi lançada em 22 de janeiro de 2011.

source: · The ninth point release, 5.0.9, was released on October 1st, 2011.
pt_pt: · A nona versão pontual, 5.0.9, foi lançada em 1 de outubro de 2011.

source: · The tenth point release, 5.0.10, was released on March 10th, 2012.
pt_pt: · A décima versão pontual, 5.0.10, foi lançada em 10 de março de 2012.

source: See the ChangeLog for details on changes between 5.0.0 and 5.0.10.
pt_pt: Consulte o ChangeLog para obter detalhes sobre alterações entre o 5.0.0 e o 5.0.10.

source: Fixes to the released stable distribution often go through an extended testing period before they are accepted into the archive.
pt_pt: As correções na versão estável (stable) lançada geralmente passam por um longo período de teste antes de serem aceitas no repositório.

source: However, these fixes are available in the dists/lenny-proposed-updates directory of any Debian archive mirror.
pt_pt: No entanto, essas correções estão disponíveis no repositório dists/lenny-proposed-updates de qualquer espelho do repositório Debian.

source: If you use APT to update your packages, you can install the proposed updates by adding the following line to /etc/apt/sources.list:
pt_pt: Se você usa o APT para atualizar seus pacotes, poderá instalar as atualizações propostas adicionando a seguinte linha ao /etc/apt/sources.list:

source: # proposed additions for a 5.0 point release
pt_pt: # Atualizações propostas para a versão 5.0

source: For information about errata and updates for the installation system, see the installation information page.
pt_pt: Para obter informações sobre erratas e atualizações para o sistema de instalação, consulte a página informações de instalação .

source: français Nederlands Português
pt_pt: English français Nederlands

source: Last Modified: Sat, Sep 9 05:38:45 UTC 2023 Last Built: Tue, Aug 6 19:49:11 UTC 2024
pt_pt: Última Modificação: Sáb, 4 de Nov de 2023, 19:59:26 UTC Última compilação: Ter, 6 de Ago de 2024, 22:08:30 UTC

source: Ports / Debian GNU/Hurd / Debian GNU/Hurd --- Documentation
pt_pt: Portes / Debian GNU/Hurd / Debian GNU/Hurd --- Documentação

source: [ Ports ] [ Debian GNU/Hurd ] [ News ] [ Configuration ] [ Hurd CDs ] [ Documentation ] [ Development ] [ Contact ]
pt_pt: [ Portes ] [ Debian GNU/Hurd ] [ Novidades ] [ Configuração ] [ CDs do Hurd ] [ Documentação ] [ Desenvolvimento ] [ Contato ]

source: Translators
pt_pt: Tradutores

source: · Concept
pt_pt: · Conceito

source: · Examples
pt_pt: · Exemplos

source: · Passive Translators, Active Translators
pt_pt: · Tradutores passivos, tradutores ativos

source: · Managing Translators
pt_pt: · Gerenciando tradutores

source: Concept
pt_pt: Conceito

source: Before we take a closer look at translators, let us consider regular filesystems.
pt_pt: Antes de examinarmos os tradutores, consideremos os sistemas de arquivos regulares.

source: A filesystem is a store for a hierarchical tree of directories and files.
pt_pt: Um sistema de arquivo é um armazenamento para uma árvore hierárquica de diretórios e arquivos.

source: You access directories and files by a special character string, the path.
pt_pt: Você acessa os diretórios e os arquivos através de uma string de caracteres especial, o caminho (path, em inglês).

source: Furthermore, there are symbolic links to refer to one file at several places in the tree, there are hard links to give one and the same file several names.
pt_pt: Além disso, existem links simbólicos para referenciar um arquivo em diversos lugares na árvore, existem hard links para dar diversos nomes a um mesmo e único arquivo.

source: There are also special device files for communication with the hardware device drivers of the kernel, and there are mount points to include other stores in the directory tree.
pt_pt: Existem também arquivos de dispositivo especiais para comunicação com os drivers de dispositivos de hardware do kernel, e existem pontos de montagem para incluir outros armazenamentos na árvore de diretórios.

source: Then there are obscure objects like FIFOs.
pt_pt: E existem objetos obscuros como os FIFOs.

source: Although these objects are very different, they share some common properties, for example, they have all an owner and a group associated with them as well as access rights (permissions).
pt_pt: Embora esses objetos sejam muito diferentes, eles compartilham de algumas propriedades comuns, por exemplo, todos eles têm um(a) proprietário(a) e um grupo associados, como também direitos de acesso (permissões).

source: This information is written in inodes.
pt_pt: Esta informação fica escrita em inodes.

source: This is actually a further commonality: Every object has exactly one inode associated with it (hard links are somewhat special as they share one and the same inode).
pt_pt: Isto é, na verdade, uma convergência adicional: todo objeto tem exatamente um inode associado a ele (hard links são algo de especial já que eles compartilham um mesmo e único inode).

source: Sometimes, the inode has further information stored in it.
pt_pt: Às vezes, o inode tem informações adicionais armazenadas nele.

source: For example, the inode can contain the target of a symbolic link.
pt_pt: Por exemplo, o inode pode conter o alvo de um link simbólico.

source: However, these commonalities are usually not exploited in the implementations, despite the common programming interface to them.
pt_pt: Contudo, esses aspectos comuns geralmente não são aproveitados nas implementações, apesar da interface comum de programação entre eles.

source: All inodes can be accessed through the standard POSIX calls, for example read() and write().
pt_pt: Todos os inodes podem ser acessados através de chamadas POSIX padrões, por exemplo, read() e write().

source: For example, to add a new object type (for example a new link type) to a common monolithic unix kernel, you would need to modify the code for each filesystem separately.
pt_pt: Ou para adicionar um novo tipo de objeto (por exemplo, um novo tipo de link) para um kernel unix comum e monolítico, você precisaria modificar o código para cada sistema de arquivos separadamente.

source: In the Hurd, things work differently.
pt_pt: No Hurd, as coisas funcionam diferentemente.

source: Although in the Hurd a special filesystem server can exploit special properties of standard object types like links (in the ext2 filesystem with fast links, for example), it has a general interface to add such features without modifying existing code.
pt_pt: Embora no Hurd um servidor especial de sistema de arquivos possa explorar propriedades especiais de tipos de objeto padrões, como os links (no sistema de arquivo ext2 com links rápidos, por exemplo), ele tem uma interface genérica para adicionar tais funcionalidades sem modificar o código existente.

source: The trick is to allow a program to be inserted between the actual content of a file and the user accessing this file.
pt_pt: O truque está em permitir a um programa que se insira entre o atual conteúdo de um arquivo e o(a) usuário(a) que está acessando este arquivo.

source: Such a program is called a translator, because it is able to process the incoming requests in many different ways.
pt_pt: Tal programa é chamado de tradutor, porque ele é capaz de processar requisições de entrada por muitas e diferentes maneiras.

source: In other words, a translator is a Hurd server which provides the basic filesystem interface.
pt_pt: Em outras palavras, um tradutor é um servidor Hurd que fornece uma interface básica de sistema de arquivos.

source: Translators have very interesting properties.
pt_pt: Os tradutores têm propriedades muito interessantes.

source: From the kernel's point of view, they are just another user process.
pt_pt: Do ponto de vista do kernel, eles são apenas outro processo de usuário(a).

source: This means, translators can be run by any user.
pt_pt: Isto é, os tradutores podem ser executados por quaisquer usuários(as).

source: You don't need root privileges to install or modify a translator, you only need the access rights for the underlying inode the translator is attached to.
pt_pt: Você não precisa de privilégios de root para instalar ou para modificar um tradutor, você somente precisa dos direitos de acesso para o inode subjacente ao tradutor ao qual está anexado.

source: Many translators don't require an actual file to operate, they can provide information by their own means.
pt_pt: Muitos tradutores não requerem um arquivo real para operar, eles podem fornecer informações por seus próprios meios.

source: This is why the information about translators is stored in the inode.
pt_pt: Este é o motivo da informação sobre tradutores ficar armazenada no inode.

source: Translators are responsible to serve all file system operations that involve the inode they are attached to.
pt_pt: Os tradutores são responsáveis por servir todas as operações de sistema de arquivo que envolvem o inode no qual estão anexados.

source: Because they are not restricted to the usual set of objects (device file, link etc), they are free to return anything that makes sense to the programmer.
pt_pt: Porque não estão restritos aos usuais conjuntos de objetos (arquivo de dispositivo, link, etc.), eles estão livres para retornar qualquer coisa que faça sentido ao(à) programador(a).

source: One could imagine a translator that behaves like a directory when accessed by cd or ls and at the same time behaves like a file when accessed by cat.
pt_pt: Pode-se imaginar um tradutor que se comporta como um diretório quando acessado por cd ou ls e, ao mesmo tempo, se comporta como um arquivo quando acessado por cat.

source: Examples
pt_pt: Exemplos

source: Mount Points
pt_pt: Pontos de montagem

source: A mount point can be seen as an inode that has a special translator attached to it.
pt_pt: Um ponto de montagem pode ser visto como um inode que tem um tradutor especial anexado a ele.

source: Its purpose would be to translate filesystem operations on the mount point in filesystem operations on another store, let's say, another partition.
pt_pt: Seu propósito seria traduzir as operações do sistema de arquivos no ponto de montagem em operações de sistema de arquivos em outro armazenamento, por exemplo, em uma outra partição.

source: Indeed, this is how filesystems are implemented under the Hurd.
pt_pt: De fato, é assim que os sistemas de arquivos são implementados sob o Hurd.

source: A filesystem is a translator.
pt_pt: Um sistema de arquivos é um tradutor.

source: This translator takes a store as its argument, and is able to serve all filesystem operations transparently.
pt_pt: Este tradutor pega um armazenamento como seu argumento e é capaz de servir todas as operações de sistema de arquivos transparentemente.

source: Device Files
pt_pt: Arquivos de dispositivo

source: There are many different device files, and in systems with a monolithical kernel, they are all provided by the kernel itself.
pt_pt: Existem muitos e diferentes arquivos de dispositivos, e em sistemas de kernel monolítico, eles são todos fornecidos pelo kernel mesmo.

source: In the Hurd, all device files are provided by translators.
pt_pt: No Hurd, todos os arquivos de dispositivo são fornecidos por tradutores.

source: One translator can provide support for many similar device files, for example all hard disk partitions.
pt_pt: Um tradutor pode fornecer suporte para vários arquivos de dispositivo similares, por exemplo, todas as partições do disco rígido.

source: This way, the number of actual translators needed is quite small.
pt_pt: Deste modo, o número de tradutores realmente existentes é muito pequeno.

source: However, note that for each device file accessed, a separate translator task is started.
pt_pt: Contudo, note que para cada arquivo de dispositivo acessado, uma tarefa de tradutor separada é iniciada.

source: Because the Hurd is heavily multi threaded, this is very cheap.
pt_pt: Porque o Hurd é profundamente multithread, isso sai muito barato.

source: When hardware is involved, a translator usually starts to communicate with the kernel to get the data from the hardware.
pt_pt: Quando hardware é envolvido, um tradutor geralmente começa a se comunicar com o kernel para obter os dados do hardware.

source: However, if no hardware access is necessary, the kernel does not need to be involved.
pt_pt: Entretanto, se não é preciso acesso ao hardware, o kernel não precisa estar envolvido.

source: For example, /dev/zero does not require hardware access, and can therefore be implemented completely in user space.
pt_pt: Por exemplo, /dev/zero não requer acesso ao hardware e, portanto, pode ser implementado completamente no espaço de usuário(a).

source: Symbolic Links
pt_pt: Links simbólicos

source: A symbolic link can be seen as a translator.
pt_pt: Um link simbólico pode ser visto como um tradutor.

source: Accessing the symbolic link would start up the translator, which would forward the request to the filesystem that contains the file the link points to.
pt_pt: Ao acessar o link simbólico, um tradutor seria iniciado, o qual encaminharia a requisição para o sistema de arquivos que contenha o arquivo para o qual o link aponta.

source: However, for better performance, filesystems that have native support for symbolic links can take advantage of this feature and implement symbolic links differently.
pt_pt: Contudo, para uma melhor performance, os sistemas de arquivos que possuem suporte nativo aos links simbólicos podem tirar vantagem desta funcionalidade e implementar links simbólicos de maneira diferente.

source: Internally, accessing a symbolic link would not start a new translator process.
pt_pt: Internamente, o acesso a um link simbólico não iniciaria um novo processo de tradutor.

source: However, to the user, it would still look as if a passive translator is involved (see below for an explanation what a passive translator is).
pt_pt: Porém, para o(a) usuário(a), ainda pareceria como se o tradutor passivo estivesse envolvido (veja abaixo uma explicação sobre o que é um tradutor passivo).

source: Because the Hurd ships with a symlink translator, any filesystem server that provides support for translators automatically has support for symlinks (and firmlinks, and device files etc)!
pt_pt: Devido ao Hurd vir com um tradutor de symlink, qualquer servidor de sistema de arquivos que fornece suporte para tradutores automaticamente tem suporte para symlinks (e firmlinks, e arquivos de dispositivos, etc.)!
